experimental/glm52_b300_fixed_seq/results/c2-four-frontier-megamoe-refresh-20260921/runs/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/native-runtime/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16/server-watch.json ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex
+ python3 -m infx.bench_serving.server_watch run --state /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/native-runtime/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16/server-watch.json -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=16, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=160, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/8k1k/w4a16-megamoe/tp4_conc16', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=32)
Generating 160 prompts using 8 worker processes...
Prompt generation completed in 4.9s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6567  max=8190  mean=7346.95  avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=915.16  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 32 requests...
100%|██████████| 32/32 [00:36<00:00,  1.13s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
  0%|          | 0/160 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 160/160 [02:27<00:00,  1.09it/s]
============ Serving Benchmark Result ============
Successful requests:                     160       
Benchmark duration (s):                  147.34    
Total input tokens:                      1175512   
Total generated tokens:                  146426    
Request throughput (req/s):              1.09      
Output token throughput (tok/s):         993.82    
Total Token throughput (tok/s):          8972.25   
---------------Time to First Token----------------
Mean TTFT (ms):                          1415.67   
Median TTFT (ms):                        658.28    
P90 TTFT (ms):                           2584.68   
P99 TTFT (ms):                           11625.93  
P99.9 TTFT (ms):                         14212.28  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.98     
Median TPOT (ms):                        14.18     
P90 TPOT (ms):                           16.27     
P99 TPOT (ms):                           17.68     
P99.9 TPOT (ms):                         17.86     
---------------Inter-token Latency----------------
Mean ITL (ms):                           1170.07   
Median ITL (ms):                         796.03    
P90 ITL (ms):                            2610.63   
P99 ITL (ms):                            5241.72   
P99.9 ITL (ms):                          7346.51   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          14213.31  
Median E2EL (ms):                        14032.86  
P90 E2EL (ms):                           17000.08  
P99 E2EL (ms):                           24848.63  
P99.9 E2EL (ms):                         27694.54  
==================================================
+ set +x